In [37]:
import pandas as pd
import re
import unidecode

In [179]:
name =  pd.read_csv(r'C:\Users\frans\Documents\GitHub\Project4-WebScrap\Files\namelower.csv')
url = pd.read_csv(r'C:\Users\frans\Documents\GitHub\Project4-WebScrap\Files\URL-Final.csv')

In [181]:
name.drop(['Unnamed: 0', 'Unnamed: 0.1', 'City'], axis=1, inplace=True)

In [182]:
name

      Rank    Country  Cost of Living              city
0        1   Portugal            3336            lisbon
1        2   Thailand            2094           bangkok
2        3  Indonesia            1932            canggu
3        4   Thailand            1316        chiang-mai
4        5  Argentina            2027      buenos-aires
...    ...        ...             ...               ...
1343  1344   Tanzania            1745     dar-es-salaam
1344  1345     Russia            2377  saint-petersburg
1345  1346    Myanmar            1357            yangon
1346  1347       Iraq            1907           baghdad
1347  1348     Russia            3032            moscow

[1348 rows x 4 columns]

In [183]:
url['city'] =  url['url'].apply(lambda x : re.findall('[^\/]+$', str(x)))
url['city'] = url['city'].apply(lambda x : ''.join(x))

In [185]:
url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1348 entries, 0 to 1347
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1348 non-null   int64
 1   url         1348 non-null   object
 2   results     1348 non-null   object
 3   result1     1348 non-null   object
 4   result2     1348 non-null   object
 5   score       1338 non-null   float64
 6   rank        1348 non-null   int64
 7   city        1348 non-null   object
dtypes: float64(1), int64(2), object(5)
memory usage: 84.4+ KB

In [186]:
final = pd.merge(url, name, on='city')
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1371 entries, 0 to 1370
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      1371 non-null   int64
 1   url             1371 non-null   object
 2   results         1371 non-null   object
 3   result1         1371 non-null   object
 4   result2         1371 non-null   object
 5   score           1357 non-null   float64
 6   rank            1371 non-null   int64
 7   city            1371 non-null   object
 8   Rank            1371 non-null   int64
 9   Country         1371 non-null   object
 10  Cost of Living  1371 non-null   int64
dtypes: float64(1), int64(4), object(6)
memory usage: 128.5+ KB

In [218]:
t2 = final[['score', 'rank', 'city', 'Rank', 'Country','url']].sort_values(by='Rank')

In [219]:
t2[t2['city']=='bloomington']

,score,rank,city,Rank,Country,url
509,2.8,461,bloomington,629,United States,https://nomadlist.com/bloomington
511,2.8,461,bloomington,629,United States,https://nomadlist.com/bloomington
510,2.8,461,bloomington,858,United States,https://nomadlist.com/bloomington
512,2.8,461,bloomington,858,United States,https://nomadlist.com/bloomington

In [213]:
final.city.value_counts()

victoria        9
lagos           4
bloomington     4
birmingham      4
salem           4
               ..
dongying        1
fort-smith      1
chania          1
intag-valley    1
moscow          1
Name: city, Length: 1315, dtype: int64

In [208]:
final.groupby('Country')['score'].mean().sort_values(ascending=False).head(50)

Country
Cayman Islands     3.560000
Portugal           3.330909
Nepal              3.285000
Cuba               3.240000
Serbia             3.233333
Mauritius          3.210000
Bulgaria           3.206000
North Macedonia    3.200000
Romania            3.177778
Poland             3.135000
Philippines        3.125000
Vietnam            3.122000
Slovenia           3.120000
Malaysia           3.117500
Kenya              3.100000
Armenia            3.090000
Thailand           3.063889
Georgia            3.043333
Latvia             3.040000
South Africa       3.036667
Lebanon            3.030000
Zimbabwe           3.020000
Sweden             3.013333
Singapore          3.010000
Bosnia             3.006667
Indonesia          3.002000
Cambodia           3.000000
Czechia            2.996667
Suriname           2.990000
Sri Lanka          2.974000
Croatia            2.973750
Moldova            2.970000
Hong Kong          2.970000
Slovakia           2.960000
Uzbekistan         2.950000
Paraguay           2.940000
Albania            2.940000
Argentina          2.931111
South Korea        2.930000
Ecuador            2.928333
India              2.917385
Guatemala          2.913333
Laos               2.906667
Palestine          2.890000
Morocco            2.887778
Tunisia            2.880000
Turkey             2.873000
Estonia            2.870000
Senegal            2.860000
Namibia            2.860000
Name: score, dtype: float64

In [209]:
final.groupby('city')['score'].mean().sort_values(ascending=False).head(100)

city
lisbon              4.34
bangkok             4.08
chiang-mai          4.06
canggu              4.04
madeira             3.88
                    ...
sao-paulo           3.17
new-york-city       3.17
playa-del-carmen    3.17
leipzig             3.16
busan               3.16
Name: score, Length: 100, dtype: float64

In [196]:
df['city'].nunique()

1315